Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Meow Rangers.tmx
Source language: ko_kr
Languages: en_us

source: 나나 디비님이나 그 영역을 탐한다는 것은...!
en_us: THE FACT THAT DB AND I ARE BOTH DYING TO EXPLORE THAT AREA...

source: 그것은 나 역시 연구하고 싶은 금단의 영역···!!
en_us: THE FORBIDDEN AREA OF STUDY THAT I’VE ALWAYS WANTED TO RESEARCH...!!

source: 생각해.
en_us: IN MY VIEW.

source: 애초에 말이지...
en_us: FROM THE START...

source: 훌륭한 신 씨몽키가 와성됐잖아.
en_us: OUR AMAZING NEW C-MONKEY IS COMPLETE.

source: [신]...
en_us: GOD...

source: 진짜였어...!
en_us: WHAT HE SAID WAS TRUE...!

source: 새로운 전쟁을 준비하기엔...
en_us: SHE’S TOO YOUNG AND FRAGILE...

source: 비켜-!!
en_us: OUT OF MY WAY!

source: - 전쟁터 (16) -
en_us: - BATTLEFIELD (16) -

source: 난 그곳에서 짬 타이거들에게 완벽하게 기억이 지워진 채로...
en_us: THE CATS IN THE MILITARY COMPLETELY ERASED MY MEMORIES...

source: - 한 달 사이 -
en_us: - THE MONTH IN-BETWEEN -

source: 너무 방심했나...
en_us: WAS I TOO CARELESS...?

source: 쿠{j}구{j}구{j}구...
en_us: CRACKLE{j}{j}{j}

source: 즐거웠네...
en_us: ...THANKS TO YOU ALL...

source: 어이 박사...
en_us: HEY, DOC...

source: 마치 초능력이 생긴 기분이야.
en_us: AND I FEEL LIKE I’VE DEVELOPED PSYCHIC POWERS.

source: 형이 한마디만 한다.
en_us: LET ME GIVE YOU SOME ADVICE.

source: 굉장하구나...
en_us: CATSUITS...

source: 먼지의 움직임으로 공격을 확인할 수 있었어...!
en_us: I WAS ABLE TO SEE HER ATTACK THROUGH THE MOVEMENT OF THE DUST...!

source: 파 아 아
en_us: BLAST

source: 다{j}다
en_us: TADADA{j}

source: 고양이 소화기 분사!!
en_us: CAT EXTINGUISHER SPRAY!

source: 파 바 바
en_us: BAM BAM WHACK

source: 이 녀석들이 이래 가지곤 실력 발휘를 할 수 없잖아.
en_us: THESE CATS ARE IN NO SHAPE TO PUT UP A FIGHT.

source: 쿠구 구 궁...
en_us: RUMBLE

source: 어서 와.
en_us: WELCOME.

source: 쿠당탕
en_us: CRASH

source: 이런 모습으로 살아있어봤자...
en_us: EVEN IF HE SURVIVES...

source: 쿠구궁...
en_us: RUMBLE

source: 대체 뭘 준비해야 하는 거냐구.
en_us: WHAT IN THE WORLD AM I SUPPOSED TO PREPARE?

source: 인간 모집이 시작 됐어!
en_us: HUMAN RECRUITMENT IS UNDERWAY!

source: 조용...히...해...
en_us: KEEP... YOUR VOICE... DOWN...

source: 지금은...
en_us: ...YOU SHOULD FIRST...

source: ...그럼 내 능력은 무엇이라 생각하나.
en_us: NOW, WHAT DO YOU THINK MY TALENT IS...?

source: 고양양옹병원
en_us: GOYANG MEOW HOSPITAL

source: 이 난동은 동료들을 위한 마지막 선물인 셈이지.
en_us: THIS RAMPAGE IS SIMPLY A FINAL PARTING GIFT FOR MY COMRADES.

source: 이걸 입고 있었단 말야...!?
en_us: I’VE BEEN WEARING THIS THE WHOLE TIME...?!

source: 역시 그 총이냐.
en_us: THAT GUN AGAIN?

source: 말풍선 하나에 요약해서 말해줄래?
en_us: CAN YOU GIVE ME THE SHORT, SIMPLE VERSION?

source: 연구라 하면...?
en_us: AND BY RESEARCH, YOU MEAN...

source: 내가...{j}악당?
en_us: BE... THE VILLAIN?{j}

source: 싸울래?
en_us: YOU WANNA FIGHT?

source: 어둠은 우리 검은 고양이들의 안식처...
en_us: DARKNESS IS THE SHELTER FOR ALL OF US BLACK CATS...

source: 무슨 냥소리냐...
en_us: WHAT IN THE CAT SHIT ARE YOU TALKING ABOUT...?

source: 사랑합니다~ ♪
en_us: LOVE HER~ ♪

source: 푸슈슉
en_us: JOLT

source: 위 이 잉...
en_us: BZZT

source: 내...
en_us: I...

source: 다...다들 당한 건가...!?
en_us: D-DID THEY ALL GET KILLED...?!

source: 오빠는 밥 먹고 그것만 했으니까 조작 잘 하겠다!
en_us: THAT’S ALL HYEONMIN DID BESIDES EATING, SO HE SHOULD BE PRETTY GOOD!

source: 너희 인간들은 우리 거다냥?
en_us: YOU HUMANS ARE ALL OURS, GOT IT?

source: 몸에 이상이 생기긴 커녕, 더 좋아진 거 아니야?
en_us: THERE’S NOTHING WRONG WITH MY BODY. IN FACT, HASN’T IT BEEN IMPROVED?

source: 사이캣!!!!
en_us: PSYCAT!!

source: ...전학생?
en_us: YOU’RE... A TRANSFER STUDENT?!

source: 냐아아앙-!!!
en_us: MEEEOOOW!!

source: 고양이 샷건 강화-!!
en_us: CAT SHOTGUN POWER UP!!

source: 게다가 술냄새까지...
en_us: PLUS, THEY REEKED OF ALCOHOL...

source: 괜찮은 겁니까!?
en_us: ARE YOU OKAY?!

source: 실험체 J-94 이후로는 뚜렷한 성과가 없습니다.
en_us: THERE’S BEEN NOTHING TANGIBLE SINCE SUBJECT J-94.

source: 엄마는 어딨어?
en_us: WHERE’S MOM?

source: 뭐...뭐야...!
en_us: WH-WHAT THE...!

source: 주...죽을 뻔 했어..!!
en_us: I-I ALMOST DIED...!!

source: 지킬 수 있었으면, 진작 지켰겠지.
en_us: IF I COULD, I’D ALREADY HAVE DONE SO.

source: 목표물 조준 완료-.
en_us: TARGET ACQUIRED.

source: 쿡쿡
en_us: HEHE

source: 멈췄어...!!
en_us: HE STOPPED...!!

source: 더 이상 인생을 허비하고 싶지 않아...
en_us: I DON’T WANT TO WASTE THE REST OF MY LIFE...

source: 스르륵
en_us: SWISH

source: 자...잠깐!!!
en_us: W-WAIT!!!

source: 웃긴 자식.
en_us: SMART ASS.

source: 레인저 놀이는 그만 뒀으니까.
en_us: I STOPPED PLAYING RANGERS.

source: 전쟁터가 아닌 곳에서 만났더라면...
en_us: HAD WE MET ANYWHERE ELSE BESIDES A BATTLEFIELD...

source: 훔친 것을 주인에게 돌려줄 시간이다.
en_us: IT’S TIME YOU GIVE BACK WHAT YOU TOOK FROM ITS RIGHTFUL OWNER.

source: 어...어디가는데!
en_us: WH-WHERE ARE YOU GOING!?

source: 큰일 났다..!
en_us: OH GOD...!

source: 죽이고 빼앗기 딱 좋군.
en_us: KILLING HIM AND TAKING THE GEM WILL BE A PLEASURE.

source: 이 능력을 다른 생물체에 이식 할 수 있는지 한참 실험중이죠.
en_us: WE’RE CONDUCTING EXTENSIVE EXPERIMENTS TO DETERMINE WHETHER WE CAN TRANSPLANT THE ABILITY INTO OTHER ORGANISMS.

source: 신인류가 완성되는 대로 현인류를 청소할 생각입니다.
en_us: BUT I THINK I’LL CLEANSE THEM AS SOON AS I FINISH MAKING NEW HUMANS.

source: 끼에엑-!!!
en_us: AAAGH!!!

source: 과과광
en_us: BLE

source: 네가 치와냐.
en_us: ARE YOU CHIWA?

source: 있어요.
en_us: BY NERO.

source: 좀 나눠줘요.{j}형ㅋㅋㅋ
en_us: GIVE US SOME THEN, HAHAHA.{j}

source: 불로불사의 육체로 냥잼의 힘까지 다루게 된다면...
en_us: IF HE OBTAINS BOTH AN IMMORTAL BODY AND THE POWER OF A MEOW GEM...

source: 오래전에 살았던 고양이.
en_us: A CAT WHO LIVED LONG AGO.

source: 스핑크스 고양이..!
en_us: A SPHYNX CAT...!

source: 막았어!!
en_us: HE BLOCKED IT!!

source: 그딴 건 모르겠고...
en_us: I DON’T KNOW ABOUT ALL THAT...

source: 흥!
en_us: HMPH!

source: 그저 평범한 고등학생.
en_us: I’M JUST AN ORDINARY HIGH SCHOOL STUDENT.

source: 뭐...뭐가 어떻게 돼가는 거냐고!!!
en_us: WH-WHAT IS GOING ON?!!

source: 우리 집사레인저들은...
en_us: ...US MEOW RANGERS...

source: 뭐야 이 자식!?
en_us: WHAT’S UP WITH THIS GUY?!

source: 여기지!?!
en_us: YOU MUST BE HERE!

source: 도망치자.
en_us: LET’S GET OUT OF HERE,

source: 그럼...
en_us: WELL THEN...

source: 오빠도 그새 적응했나보네.
en_us: I GUESS YOU’VE GOTTEN USED TO IT TOO.

source: 내 능력은 어둠속에 숨는게 아니라 어둠과 하나가 되는 것.
en_us: I DON’T HIDE IN THE DARKNESS, I BECOME ONE WITH THE DARKNESS.

source: 호...{j}혼란 스러워..!
en_us: I-I’M CONFUSED...!{j}

source: 전투 요원은 아니지만 힘 좀 서볼까.
en_us: I’M NOT A FIGHTER, BUT I’LL GIVE IT A SHOT.

source: 동물 병원인가요...?
en_us: ...AN ANIMAL HOSPITAL...?

source: 엄마가 이번주 내로 알려준대.
en_us: MY MOM WILL LET ME KNOW THIS WEEK.

source: 고{j}오{j}오{j}오
en_us: LOOM{j}{j}{j}

source: 세계정부가 내놓은 해결책
en_us: ALLOW ME TO INTRODUCE...

source: 나 처럼 살면 안된다.
en_us: DON’T LIVE LIKE ME.

source: 겨우 그런 각오로 냥인을 구원하겠다니...
en_us: TO THINK YOU’LL RESCUE CAT PEOPLE WITH THAT MINDSET...

source: 그 날 이후로 연락이 잘 안 돼.
en_us: ...BUT I HAVEN’T BEEN ABLE TO GET IN TOUCH WITH HER EVER SINCE.

source: 정신차려...!!
en_us: WAKE UP...!!

source: 와르르
en_us: DUMP

source: 비틀...
en_us: WOBBLE

source: 도망친 녀석까지 쫓아가 잡는 건 힘 낭비야..!
en_us: IT’D BE A WASTE TO CHASE AFTER HIM...!

source: 로봇이 꿈쩍 안 하고 있어!
en_us: ...BUT THE ROBOT ISN’T MOVING!

source: ...너 이자식...
en_us: YOU FOOL...

source: 파지 직
en_us: PZZT

source: 꽈아 악..
en_us: SQUEEZE

source: 엉뚱한 녀석...
en_us: SUCH A WEIRDO...

source: 네 녀석을 죽이고 싶은게 아니야...
en_us: IT’S NOT THAT I WANT TO KILL YOU...

source: [캣타운 단지]를 소개합니다.
en_us: ...THE CAT TOWN COMPLEX.

source: ...응?
en_us: WHAT...?

source: 형ㅋㅋㅋ
en_us: BRO HAHAHA

source: 치와?
en_us: ...CHIWA?

source: 네가 이 전쟁터에 나온 이유는 뭐지!?
en_us: WHY ARE YOU ON THE BATTLEFIELD?!

source: 민식이랑, 호열 아저씨...
en_us: DON’T BLAME YOURSELF...

source: 이...{j}이곳이 함선...
en_us: S-SO THIS IS A SHIP...{j}

source: 말로 해서 해결될 문제면
en_us: RELAX. I HAVE NO PLANS TO FIGHT...

source: 누군가에게 덤빈다는 건 상처입을 각오가 된 자만이 할 수 있는 일이야.
en_us: IF YOU ATTACK ME, IT MEANS YOU’RE WILLING TO GET HURT.

source: 뭔데...
en_us: WHAT’S GOING ON...?

source: 저 사람 왜 저래-!!
en_us: WHAT’S HIS DEAL?!

source: 게이지 언제 다 차는데!!
en_us: HOW LONG BEFORE THE GAUGE RECHARGES?!

source: 내 소중한 사람 모두가...!!
en_us: ALL THE PEOPLE I LOVED...!!

source: 시...시간 없는 거 아니야!?
en_us: I-IS THAT ENOUGH TIME?!

source: 고요..
en_us: SILENCE

source: 근처야?
en_us: IS IT CLOSE?

source: 벽...벽지를 그렇게 뜯으면...
en_us: Y-YOU CAN’T JUST SCRATCH THE WALLPAPER LIKE THAT...

source: 나도 하나만.
en_us: GIVE ME ONE TOO.

source: 다들 너한테 고마워 한다고.
en_us: EVERYONE IS GRATEFUL FOR YOU.

source: 이게 내 능력이다-.
en_us: ...IS MY TALENT.

source: 케헥!!
en_us: UGHH!!

source: 지구 청소.
en_us: CLEANSING THE EARTH.

source: 어떻게 할까요~ ♪
en_us: WHAT CAN I DO~ ♪

source: 은밀한 곳으로 데려가서 뚜드려 패려는 거야!
en_us: SHE’S GONNA TAKE ME SOMEWHERE QUIET AND BEAT THE CRAP OUT OF ME!

source: ..여정이라는 말을 붙일 만큼 즐거운 곳은 아니었지.
en_us: IT WASN’T SO ENJOYABLE THAT I’D CALL IT A TRIP.

source: 자...
en_us: I...

source: 진심으로 싸우도록 하지.
en_us: I WON’T HOLD BACK ANYMORE.

source: 덜덜
en_us: TREMBLE TREMBLE

source: 수련이다.
en_us: IT’S TRAINING.

source: 레인저들을 완전히 적으로 돌리게 될 것입니다.
en_us: ...THE MEOW RANGERS WILL FOREVER TURN THEIR BACKS ON YOU.

source: 덜 덜 덜...
en_us: QUIVER QUIVER

source: 네로님을 부탁한다.
en_us: TAKE CARE OF MASTER NERO FOR ME.

source: 이 녀석 때문에...
en_us: THANKS TO THIS JERK...

source: 우리집 게임 컨트롤러랑 똑같이 생겼어!
en_us: LOOKS JUST LIKE THE GAME CONTROLLER WE HAVE AT HOME!

source: 방금 공격은 꽤 제대로 들어갔어.
en_us: THAT LAST ATTACK WAS RIGHT ON THE MONEY.

source: 칫
en_us: TSK

source: 지구에서 냥인 해방을 위해 힘쓰던 분들입니다.
en_us: THEY FOUGHT FOR THE LIBERATION OF CAT PEOPLE ON EARTH.

source: 근데 말이지...
en_us: BUT LET ME TELL YOU SOMETHING...

source: 너희들이라면 쉽게 다룰 수 있을 거야!
en_us: IT’LL BE A BREEZE FOR YOU TWO!

source: 냥국의 왕실엔 냥군에 입대하는 전통이 있지.
en_us: IT’S TRUE THE ROYAL FAMILY OF CAT NATION HAS A TRADITION OF ENLISTING.

source: 오늘 일 부터 마무리 짓고...!
en_us: ...ONCE WE FINISH OUR JOB TODAY...!

source: 현실안주형
en_us: STORY/ART: AHNJOO

source: 아이~ 냐발.
en_us: AAH FURK.

source: 진정해!
en_us: CALM DOWN!

source: 나 같아도 안 믿겠다.
en_us: EVEN I WOULDN’T BELIEVE IT MYSELF.

source: 너 지금 몸으로 그렇게 움직이면 다쳐!!!
en_us: YOU’RE GONNA GET HURT MOVING AROUND LIKE THAT!!!

source: 파 밧
en_us: SMACK

source: 혜민이 아련연기 집에서 연습했지!?
en_us: YOU PRACTICED ACTING SAD AT HOME, DIDN’T YOU?!

source: 어이.
en_us: HEY.

source: (주) 해 동 종 합 건 설
en_us: HAEDONG CONSTRUCTION, LLC.

source: 깜돌, 더 이상은 못참아!
en_us: THAT DOES IT, SHADOW!

source: 다들 정신차리고 일어서요!!
en_us: EVERYONE, SNAP OUT OF IT AND GET UP!!

source: 깨어나서 다행이다...!!
en_us: THANK GOODNESS YOU’RE AWAKE...!!

source: 발톱도 빨리 자라고...
en_us: ANY MY CLAWS ARE GROWING FAST...

source: '압축 근육 모드'
en_us: IS HE USING...

source: 그러지말고 같이 눕지 그래.
en_us: WHY DON’T YOU JOIN THEM ON THE GROUND INSTEAD?

source: 인공지능 'Kiti'
en_us: KITI, THE ARTIFICIAL INTELLIGENCE.

source: 아까는 신나게 팼겠다...?
en_us: YOU HAD YOUR FUN BEATING ME UP...

source: 대신 싸우게 하려고 인간들을 겁준 거라고.
en_us: ...FRIGHTENED US SO THAT WE’D FIGHT IN THEIR PLACE.

source: 이토록 다루기 쉬울 줄이야.
en_us: WHO KNEW IT’D BE THIS EASY?

source: 평화로워 보이지만 곧 피바람이 불거다.
en_us: ...MIGHT SEEM PEACEFUL, BUT SOON IT’S GONNA BE A BLOODBATH.

source: 이런 방법이!!
en_us: I CAN’T SEE THE ATTACK IF IT’S COMING THROUGH THE GROUND!

source: 잊지마...
en_us: DON’T FORGET...

source: 영업 끝났습...
en_us: WE’RE CLOSED--

source: 마음의 준비...?
en_us: ...AND BRACED HIMSELF...?

source: 같이 싸워줄게!
en_us: I’LL FIGHT WITH YOU!

source: 냐아앙!!
en_us: MEOOOW!!

source: 아저씨...!!
en_us: ...MR. HOYEOL...!!

source: - 전쟁터 (9) -
en_us: - BATTLEFIELD (9) -

source: 불로불사의 가능성을 알게 된 이후로...
en_us: EVER SINCE HE LEARNED OF THE FOUNTAIN OF YOUTH...

source: 평화로운 방법으로 우리 문제를 해결하고 싶은데...
en_us: I’D LIKE TO RESOLVE OUR LITTLE PROBLEM PEACEFULLY...

source: 오래 싸우진 못 할 거야.
en_us: HE WON’T BE ABLE TO FIGHT FOR LONG.

source: 내 몸에 무슨 짓을 해버린 거냐...!
en_us: WHAT HAVE YOU DONE TO ME...?!

source: 두고보자!
en_us: JUST YOU WAIT!

source: 크아아
en_us: GRRR

source: 제대로 할 줄 아는 거 아무 것도 없는 평범한 아이인데...!
en_us: I’M JUST AN ORDINARY KID. WHAT DO I KNOW ABOUT ANYTHING...?

source: 고오오
en_us: GWAAA

source: ...그런 말을 하는 걸 보니...
en_us: YOU MUST BE A POWERFUL CAT PERSON...

source: 이 냥잼이 있으면 그녀처럼 싸울 수 있을 거야.
en_us: WITH THIS MEOW GEM, YOU’LL BE ABLE TO FIGHT LIKE HER.

source: 어찌합니까~ ♪
en_us: WHAT SHOULD I DO~ ♪

source: 신세는 내가 더 많이졌다고...!!
en_us: I’M THE GRATEFUL ONE...!!

source: 디...디비님!?
en_us: M-MASTER DB?!

source: 재미없어...
en_us: SO BORING...

source: 슈욱
en_us: SWING

source: 농담이야.{j}농담.
en_us: I’M JUST JOKING.{j}

source: 웬 떡이냐.
en_us: JACKPOT.

source: 무...
en_us: THAT...

source: 타{j}앗
en_us: SMACK{j}

source: 아, 디비님.
en_us: AH, MASTER DB.

source: 자, 속력과 속도...
en_us: NOW, WHEN IT COMES TO SPEED AND VELOCITY...

source: 사방에 안개를 만들면
en_us: IF I SURROUND MYSELF WITH SMOKE...

source: 저 옷은 아까 패싸움하던 사람들이 입던 옷...!
en_us: YOU’RE WEARING THE SAME CLOTHES AS THOSE PEOPLE FIGHTING EARLIER...!

source: 대머리.
en_us: BALDY.

source: 따 다
en_us: GRIT

source: 혼란 스러워..!
en_us: I’m confused..!

source: 근데 나란 녀석은...!!
en_us: BUT AS FOR ME...

source: 마음 같아선 모두를 구하고 싶습니다만,
en_us: I WISH I COULD SAVE YOU ALL...

source: 네가 지키면 되잖아.
en_us: YOU CAN LOOK AFTER HER.

source: 하아악
en_us: HIIISS

source: 지구를 침범하려는 냥인(고양이)들을 막기 위해
en_us: THEY WERE HUMAN WARRIORS SELECTED BY CAT PEOPLE...

source: 네 녀석의 커스텀 시계가 필요해...!
en_us: I NEED YOUR CUSTOM WATCH...!

source: 내가...{j}떨고 있다니...!!
en_us: HOW... COULD I BE TREMBLING...?!{j}

source: 응.
en_us: SURE.

source: 풉..!
en_us: PFFT...!

source: 저벅..
en_us: STEP

source: 처 억
en_us: CLACK

source: 그래, [신 냥인]을 만날 기회.
en_us: THAT IS, A NEW CAT PERSON.

source: 물론, 강한 정신력을 가진 자들은 저항했지만...
en_us: OF COURSE, MENTALLY STRONG PEOPLE RESISTED...

source: 지구인 체형에 맞춘 리모델링 완료
en_us: REMODELING TO FIT EARTHLING PHYSICAL NEEDS COMPLETED

source: 방문해서 현장에서 입주 신청까지 한 번에 하세요!
en_us: SO COME FOR A VISIT AND SUBMIT YOUR APPLICATION IN ONE TRIP!

source: 도...{j}동식 선배..!
en_us: D-DONGSIK...!{j}

source: 그런데 말입니다.
en_us: HOWEVER...

source: 아냐...
en_us: NO...

source: 염동력이 약해졌다는 신호다...!
en_us: THIS MUST MEAN MY PSYCHOKINESIS IS WEAKENED...!

source: 캣닢 끊기로 했잖...
en_us: YOU PROMISED TO QUIT CATNIP--

source: 우유만 먹으면 설사를 하더라니...!
en_us: ...WHOLE MILK GIVES ME DIARRHEA...!

source: 하악...!
en_us: HACK...!

source: 냥?
en_us: MEOW?

source: 결국, 뜻대로 다음단계로 넘어갔군요.
en_us: I SUPPOSE YOU’VE TAKEN IT TO THE NEXT PHASE.

source: 그냥...
en_us: THE FACT THAT...

source: 그저 살아남기 위해 집사가 된 집사...
en_us: SOME BECAME RANGERS TO PROTECT THEIR OWN SKIN...

source: 이...{j}이걸 입고 있었단 말야...!?
en_us: I’VE BEEN WEARING THIS THE WHOLE TIME...?!

source: 왔어!!
en_us: WE’RE HERE!!

source: 오합지졸 레인저들이 따를 만한 실력자가 남아있나?
en_us: THE REST ARE SCATTERED. IS THERE ANYONE LEFT TO LEAD THEM?

source: 지구 청소.{j}인간 재활용, 캣닢 재배.
en_us: CLEANSING EARTH, RECYCLING HUMANS, AND CULTIVATING CATNIP.{j}

source: 계속 '어둠속에' 숨어버린다 이거지...!?
en_us: HE’LL CONTINUE TO HIDE IN THE DARKNESS, HUH...?!

source: 아니 놔 봐.
en_us: LET GO OF ME.

source: 미친X 소리만 들을거야.
en_us: THEY’D JUST THINK I’M RIDICULOUS.

source: '나비야' 원조
en_us: THE ORIGINAL “BUTTERFLY.”

source: 저희도 좀 주세요.
en_us: GIVE US SOME TOO.

source: 도망쳐야 하는 건 너다.
en_us: YOU’RE THE ONE WHO SHOULD RUN.

source: 이 씨몽키자식아!
en_us: YOU PIECE OF C-MONKEY!

source: 얼마나 입고 있었던 거지...?
en_us: HOW LONG HAVE I BEEN WEARING THIS...?

source: 미쳤나?
en_us: HE’S GONE BANANAS.

source: 됐어!!
en_us: THAT’S IT!!

source: 울
en_us: ;ODAJFG;S

source: 슬슬 고백할 시간이군요.
en_us: I SUPPOSE IT’S TIME TO CONFESS...

source: 대충이라도 보이면 피할 수 있다고!
en_us: I CAN AVOID ANY ATTACK I CAN SEE EVEN VAGUELY!

source: 크윽..!
en_us: GRRR

source: 왜 우는데!
en_us: WHY ARE YOU CRYING?!

source: 역시 엄마...!!
en_us: MOM...!!

source: 하핫..
en_us: HAH

source: 바짝 붙여-!!
en_us: GET CLOSER!!

source: 내 여동생에게 시계를 줄 수 있겠어?
en_us: ...CAN YOU GIVE THE WATCH TO MY SISTER?

source: 오그라들게.
en_us: IT’S SO CRINGY.

source: 왜 계속 근처에서 어슬렁거리는 거야?
en_us: WHY ARE THEY STILL HANGING AROUND HERE?

source: 어어..!?
en_us: HUH...?!

source: 먼저 가.
en_us: GO ON AHEAD.

source: 알겠다...!
en_us: I GET IT...!

source: 냥잼의 풀파워 에너지를 몸으로 받아내야하니, 몸이 멀쩡할리가 없죠.
en_us: THE BODY MUST ABSORB THE FULL POWER OF A MEOW GEM. NO ONE COMES AWAY FROM IT UNSCATHED.

source: 그것과 결합이라니...
en_us: WHAT DO YOU MEAN FUSE...?!

source: 이 힘까지 탐내고 있어...!?
en_us: HE WANTS THIS POWER FOR HIMSELF TOO...?!

source: 이런 방법으로 널 잡으려 했던 건 아닌데..!!
en_us: THIS WASN’T HOW I TRIED TO CATCH YOU...!!

source: 냥인들이 찾아오면 인간은 전부 말살 될 줄 알았는데...
en_us: I THOUGHT CAT PEOPLE WOULD SLAUGHTER ALL HUMANS ONCE THEY ARRIVED...

source: 멋지십니다!
en_us: AMAZING!

source: ...얼굴...?
en_us: GOOD LOOKS...?

source: 못 믿겠다는 건가.
en_us: DOES SHE NOT TRUST ME?

source: 샤{j}랄{j}라
en_us: SPARKLE{j}{j}

source: 모두 목숨을 걸고 싸워줬는데...!
en_us: EVERYONE WAS FIGHTING WITH THEIR LIVES ON THE LINE...!

source: 이대로라면...!
en_us: AT THIS RATE...!

source: 어떡하지?!
en_us: WHAT SHOULD I DO?!

source: 어차피 죽일 거...
en_us: SINCE HE’LL DIE ANYWAY...

source: 두동강 날 각오는 하고 입을 연거겠지.
en_us: YOU MUST REALLY WANT TO BE CUT IN HALF.

source: 오빠?
en_us: HYEONMIN?

source: 촥-
en_us: POINT

source: 사...살았다...!
en_us: I-I’M SAVED...!

source: 가...{j}감히 왕자님께 적의를...!!
en_us: H-HOW DARE YOU INSULT THE PRINCE...!{j}

source: 촤 앗
en_us: SLASH

source: 드디어...
en_us: FINALLY...

source: 주스로 만들어주마.
en_us: I’LL BEAT YOU TO A PULP.

source: 하악
en_us: HISS

source: 이정도는 해줘야 내가 주목받지.
en_us: BUT I’LL TAKE THE SPOTLIGHT THIS TIME.

source: 뭐야 저게!!
en_us: WHAT IS THAT!!

source: 아하핫!
en_us: AHAHA!

source: 호오
en_us: HOH

source: 촤 아 악
en_us: WOOSH

source: 사이캣처럼 선천적으로 타고나야 능력에 적응할 수 있다는 말인가...
en_us: DOES THAT MEAN ONLY THOSE BORN WITH THE ABILITY LIKE PSYCAT CAN CONTROL IT...?

source: 오빠...
en_us: HYEONMIN...

source: 지금은 평화로워 보이지만
en_us: IT MAY SEEM PEACEFUL NOW...

source: 라고 부탁했었지.
en_us: ...IS WHAT I REQUESTED.

source: 저기 있으니까.
en_us: ...ARE RIGHT UP THERE.

source: 두 번 다시 없을 기회는 원하지 않을 때 찾아오곤 해서, 선택을 망설이게끔 하지.
en_us: ONCE-IN-A-LIFETIME OPPORTUNITIES FIND YOU WHEN YOU DON’T EXPECT THEM, AND THAT MAKES PEOPLE HESITATE.

source: 아무것도 못하고 도망만 치잖아!
en_us: HE’S USELESS. ALL HE DOES IS RUN AWAY!

source: 누...
en_us: W-WHO ARE YOU...?!

source: 거기 다친 곳!!
en_us: THAT’S WHERE I GOT INJURED!!

source: 찍...!?
en_us: TWEEK...?!

source: 후퇴한다!!
en_us: I RETREAT!!

source: 오빠가 녀석들을 증오하는 만큼...
en_us: I HATE AND FEAR THEM...

source: 냥행성도 슬슬 과포화 상태라서 말이죠.
en_us: CAT PLANET IS NEARLY OVERPOPULATED, YOU SEE.

source: 민지 이사 가!?
en_us: YOU’RE MOVING, MINJI?!

source: 변신도 풀린 주제에
en_us: DO YOU THINK YOU CAN HANDLE US...

source: 둘 다 멈춰.
en_us: BOTH OF YOU STOP.

source: 뒤졌어!
en_us: HE’S DEAD MEAT!

source: 덕분에 안 맞아도 될 거 더 처맞고 왔던 것도 기억하니?
en_us: DO YOU ALSO REMEMBER I GOT BEATEN UP AGAIN AFTER THAT THANKS TO YOU?

source: 제가 살아온 곳은 [냥행성].
en_us: ...BUT CAT PLANET IS MY HOME.

source: 속일 수 밖에 없었던 우리를..
en_us: ...FOR HAVING TO DECEIVE YOU...

source: 당신 누구야...?
en_us: WHO ARE YOU...?

source: 내가 말했잖아!!
en_us: I TOLD YOU!!

source: 아냐...!
en_us: NO...!

source: 와라...!!
en_us: BRING IT ON...!!

source: 너 미쳤냐?
en_us: WHAT THE HELL IS WRONG WITH YOU?

source: 지금 냥인들은 세대를 거듭할 수록 교육,교양 수준은 낮아졌습니다.
en_us: CAT PEOPLE ON EARTH HAVE BECOME LESS EDUCATED AND CULTURED OVER THE GENERATIONS.

source: 우주선에 잡혀가고 싶다면 말이지!!
en_us: DO IT! IF YOU WANNA GET SENT UP TO THE SPACESHIP!!

source: 전혀...
en_us: NOT AT ALL...

source: 도...
en_us: DO...

source: 촤{j}아{j}악
en_us: SLASH{j}{j}

source: 다들...{j}어딨어?
en_us: WHERE IS...{j} EVERYONE?

source: 가만두지 않을 거야...!!
en_us: ...I WON’T LET IT SLIDE...!!

source: 선빵.
en_us: ATTACK.

source: ...그렇다면 이건 어떨까.
en_us: IN THAT CASE... HOW ABOUT THIS?

source: 인간들을 청소할 때, 같이 청소될 운명인지도 모르고...
en_us: HE DOESN’T EVEN KNOW HE’LL ALSO BE WIPED OUT WHEN THE HUMAN CLEANSING BEGINS...

source: 변신해제!!
en_us: RELEASE TRANSFORMATION!!

source: 우리는 위에서 난동을 부린 덕에 인공지능의 리스트에 올라가 있을 거야.
en_us: AFTER THE TROUBLE WE STIRRED UP ON THE SHIP, THE A.I. PROBABLY BLACKLISTED US.

source: 우리의 삶은 그대로였다.
en_us: OUR LIVES REMAINED THE SAME.

source: 제...젠장...
en_us: C-CRAP...

source: 저 냥인한테 뜯자.
en_us: LET’S TAKE IT OFF HIM.

source: ...치와라는 자를 보고 싶군.
en_us: I’D LIKE TO MEET THIS CHIWA...

source: 다시해봐 다시!
en_us: DO IT AGAIN!

source: 3개월 안에 업적을 인정받는 건...
en_us: GETTING ACKNOWLEDGED FOR AN ACHIEVEMENT WITHIN THREE MONTHS...

source: 어어 잠깐-!!
en_us: HEY, HOLD ON!!

source: 운이 좋았습니다.
en_us: YOU’RE VERY LUCKY

source: 콰 드득
en_us: CRUMBLE

source: 장치가 불안정해 kiti를 재가동합니다.
en_us: SYSTEM UNSTABLE, COMMENCING KITI REBOOT.

source: 엇!?
en_us: HUH?!

source: 이자식-!!
en_us: YOU BASTARD!!

source: 네가 집사레인저가 된 이유에 대해서...
en_us: ...EXPLAIN TO ME...

source: 사이캣-.
en_us: PSYCAT.

source: 소중한 사람들을 잃게 될지는 모르는 이 상황도!
en_us: THEN I COULD LOSE THE PEOPLE I CHERISH!

source: 할 땐 하는 멋진 사람이네.
en_us: BUT YOU’RE ACTUALLY A MAN OF ACTION.

source: 일부러 깜돌과 나를 갈라놨어...!
en_us: SHE SEPARATED ME AND SHADOW ON PURPOSE...!

source: 엉뚱한 곳을 공격했잖아...?
en_us: SHE HIT THE WRONG SPOT...!

source: 편한 방법이 있네.
en_us: THERE’S AN EASY WAY.

source: 안 됐어...
en_us: I’M SO SORRY...

source: 엄청난 힘이 담긴 냥잼까지,
en_us: ...BUT ALSO THE IMMENSELY POWERFUL MEOW GEMS..

source: 이쪽으로 오고 있어!!!
en_us: IT’S COMING THIS WAY!!!

source: 내 안의 어둠 속...!?
en_us: THE DARKNESS WITHIN ME...?!

source: 쿨럭...!!
en_us: COUGH...!!

source: 그...{j}그런...!
en_us: WH-WHAT...?!{j}

source: 콰드
en_us: RUM

source: 으앗!!
en_us: WHOA!!

source: 왜 그렇게 한숨을 푹푹 셔?
en_us: WHY ARE YOU SIGHING?

source: 이곳 문제에 대해 냥행성에서 본격적으로 관심을 가질테니...
en_us: THEN THE CAT PLANET WILL DEVELOP A GREATER INTEREST IN THE ISSUES HERE...

source: 혼수상태...?
en_us: COMATOSE...?

source: 냥잼과 슈트를 연결합니다.
en_us: CONNECTING SUIT WITH MEOW GEM.

source: 미친놈.
en_us: WEIRDO.

source: 당장 나를 불렀어야지...!
en_us: YOU SHOULD’VE CALLED ME RIGHT AWAY...!

source: 냐아아아앗!!!
en_us: MEOOOW!!!

source: 하핫.
en_us: HAHA.

source: 못받은
en_us: UNRECEIVED

source: 다른 사람들은 저항은 커녕 도망칠 수 없다구!
en_us: THEY CAN’T FIGHT BACK! HECK, THEY CAN’T EVEN RUN AWAY!

source: 자, 이것이 [역방향 텔레포트 장치]를 탑재한 슈트.
en_us: SO, THIS IS THE SUIT EQUIPPED WITH THE REVERSE TELEPORTATION DEVICE.

source: 안 움직여...
en_us: WON’T MOVE...

source: 쿠 구
en_us: WHAM

source: 잡았다!
en_us: GOTCHA!

source: 미...{j}미안.{j}치와.
en_us: S-SORRY, CHIWA.{j}{j}

source: 민남매 어머니
en_us: HYEMIN AND HYEONMIN’S MOTHER

source: 열 받냐!?
en_us: DOES THAT PISS YOU OFF?!

source: 키킥, 어이!
en_us: HEHE. YOU!

source: 마...
en_us: NO...

source: 부하들은 보내줘.
en_us: ...SO PLEASE LET THEM GO.

source: 그래서 동맹을 제안한 거구나...
en_us: SO THAT’S WHY YOU SUGGESTED AN ALLIANCE...

source: 일부 냥인이란 건 사이캣씨처럼 특별한 냥인들을 말한 겁니다.
en_us: BY CERTAIN CAT PEOPLE, I MEANT SPECIAL ONES, LIKE PSYCAT.

source: 쾅
en_us: SMASH

source: 냥잼은 내게 넘겨.
en_us: ...HAND OVER THE MEOW GEM TO ME.

source: 저 이상한 힘...!
en_us: THAT UNBELIEVABLE STRENGTH...!

source: 언제 끝나...?
en_us: WHEN WILL THIS BE OVER...?

source: 과{j}광
en_us: WHAM{j}

source: 당했다...!
en_us: THEY BEAT ME...!

source: 냥행성에선 절대 만들어질 수 없는 돌연변이 냥인.
en_us: MUTANT CAT PEOPLE LIKE HER AREN’T POSSIBLE TO CREATE ON CAT PLANET.

source: 저 녀석만 잡으면 이 지긋지긋한 싸움, 끝나는 거 아냐?!
en_us: IF WE CATCH HIM, WILL THAT PUT AN END TO THIS HORRIBLE FIGHT?!

source: 내 모든 것을 쏟아부어서...
en_us: I WANT TO THROW EVERYTHING I’VE GOT...

source: 나는 네로와 다른 임무를 수행 중이야.
en_us: I’M ON A DIFFERENT MISSION THAN NERO...

source: 오지말라했다?
en_us: I TOLD YOU TO STAY BACK.

source: 씨몽키 주제에.
en_us: YOU’RE JUST A C-MONKEY.

source: 촤 라 락
en_us: CLICK CLICK

source: 안녕하십니까.{j}지구인 여러분.
en_us: GREETINGS, EVERYONE.{j}

source: 야...!
en_us: HEY...!

source: 이 녀석...!?
en_us: THIS GUY...?!

source: 세뇌파가 통하지 않는 사람들을 골라낸 것 같더군.
en_us: IT SEEMS ONLY THOSE NOT AFFECTED BY THE BRAINWASHING WAVES WERE SELECTED.

source: 어차피 다칠 녀석들이었어.
en_us: THEY WERE ASKING FOR IT.

source: 콰아 앙
en_us: BOOOM

source: 이 자식, 감히 네로님을 속여!?
en_us: YOU BASTARD, HOW DARE YOU TRICK MASTER NERO?!

source: 왕자님!
en_us: OUR PRINCE!

source: 샤방~
en_us: TWINKLE

source: 아{j}아{j}아
en_us: BZZZ

source: 어?!
en_us: HUH?

source: 본체에 데미지를 입었어...!
en_us: MY BODY’S TAKEN A HIT...!

source: 형이 너희 안타까워서 그래...
en_us: I FEEL BAD FOR YOU IS ALL...

source: 여어, 박사.
en_us: YO, DOC.

source: 배신같은 비겁한 짓은 너희 집사레인저 들이나 하는 짓이지.
en_us: YOU MEOW RANGERS ARE THE REAL BETRAYERS AND COWARDS.

source: 인지 굴절 최대치.
en_us: COGNITIVE REFRACTION MAXIMIZED.

source: 꽤 하는 녀석들이었군.
en_us: YOU’RE PRETTY TOUGH.

source: 정신 사나워...
en_us: SO NOISY...

source: 니까짓게 뭐라고 속여!
en_us: WHY WOULD I LIE TO YOU?!

source: 누군가 끼어드는 싸움은 이래서 싫다니까...
en_us: THIS ISN’T A FIGHT YOU CAN JUST BUTT IN ON...

source: 3일...?
en_us: THREE DAYS...?

source: 공포를...!!
en_us: THE FEAR...!!

source: 안락한 집을 찾아서 올라왔겠지만...
en_us: THEY’LL COME IN SEARCH OF A NICE, COZY HOME, BUT...

source: 함장님을 만나볼까요.
en_us: SHALL WE MEET THE CAPTAIN?

source: 네 마음 속에도 존재하지.
en_us: THERE’S DARKNESS EVEN IN YOUR HEART.

source: 쿠{j}당{j}탕
en_us: CRASH{j}{j}

source: 괜찮으세요?!
en_us: ARE YOU OKAY?!

source: 아차피!!
en_us: I NEVER WANTED...
